# People Report Data

In [14]:
import pandas as pd
import numpy as np
import sqlalchemy
from sqlalchemy import create_engine
#format: [DB_FLAVOR]+[DB_PYTHON_LIBRARY]://[USERNAME]:[PASSWORD]@[DB_HOST]:[PORT]/[DB_NAME]
engine = create_engine('mysql+mysqlconnector://cnguyen:Imq2MPSzsF5wdd8fBGA@hr-api-production-replica.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/humi')

In [15]:
engine_2 = create_engine('mysql+mysqlconnector://ili:f9FqFe93htPT13nzx@humi-data-agg.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/test')

## Background info

### companies live numbers

In [16]:
Total_company_query = "select id, created_at,locked_at,deleted_at \
from `companies` where deleted_at is null"
companies = pd.read_sql_query(Total_company_query, con=engine)

In [17]:
companies = companies.astype({'locked_at':'datetime64'})

In [18]:
companies_2019 = companies[companies['created_at']<'2019-12-31 23:59:59']

In [19]:
companies_2019.loc[((companies_2019['locked_at'].isna())|
                   (companies_2019['locked_at']>'2019-12-31')),"live data"] = True
companies_2019 = companies_2019[companies_2019['live data'] == True]
companies_2019

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

       id          created_at  locked_at deleted_at live data
0       2 2018-05-14 15:24:27        NaT       None      True
3       8 2018-05-28 19:55:32        NaT       None      True
4       9 2018-05-30 14:24:17        NaT       None      True
5      10 2018-05-30 19:44:21 2020-03-06       None      True
6      11 2018-05-31 19:38:00        NaT       None      True
..    ...                 ...        ...        ...       ...
580  1113 2019-12-20 15:29:25 2020-11-24       None      True
581  1114 2019-12-20 17:38:50        NaT       None      True
582  1116 2019-12-23 14:47:11 2021-05-17       None      True
583  1117 2019-12-23 21:22:32        NaT       None      True
584  1118 2019-12-30 17:26:23 2021-01-26       None      True

[533 rows x 5 columns]

In [20]:
companies_2020 = companies[companies['created_at']<'2020-12-31 23:59:59']

companies_2020.loc[(companies_2020['locked_at'].isna()|
                   (companies_2020['locked_at']>'2020-12-31')),"live data"] = True
companies_2020 = companies_2020[companies_2020['live data'] == True]
companies_2020

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

        id          created_at locked_at deleted_at live data
0        2 2018-05-14 15:24:27       NaT       None      True
3        8 2018-05-28 19:55:32       NaT       None      True
4        9 2018-05-30 14:24:17       NaT       None      True
6       11 2018-05-31 19:38:00       NaT       None      True
7       12 2018-06-01 15:45:51       NaT       None      True
...    ...                 ...       ...        ...       ...
1246  1922 2020-12-23 15:31:06       NaT       None      True
1247  1925 2020-12-23 18:39:10       NaT       None      True
1248  1927 2020-12-31 17:53:17       NaT       None      True
1249  1928 2020-12-31 19:27:00       NaT       None      True
1250  1929 2020-12-31 20:01:09       NaT       None      True

[1113 rows x 5 columns]

In [21]:
companies_2021 = companies[companies['created_at']<'2021-12-31 23:59:59']

companies_2021.loc[(companies_2021['locked_at'].isna())|
                   (companies_2021['locked_at']>'2021-12-31'),"live data"] = True
companies_2021 = companies_2021[companies_2021['live data'] == True]
companies_2021

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

        id          created_at locked_at deleted_at live data
0        2 2018-05-14 15:24:27       NaT       None      True
3        8 2018-05-28 19:55:32       NaT       None      True
4        9 2018-05-30 14:24:17       NaT       None      True
6       11 2018-05-31 19:38:00       NaT       None      True
7       12 2018-06-01 15:45:51       NaT       None      True
...    ...                 ...       ...        ...       ...
1934  2686 2021-08-11 00:31:14       NaT       None      True
1935  2687 2021-08-11 19:49:03       NaT       None      True
1936  2688 2021-08-11 19:53:41       NaT       None      True
1937  2689 2021-08-13 13:24:04       NaT       None      True
1938  2690 2021-08-13 13:57:33       NaT       None      True

[1645 rows x 5 columns]

### employee live numbers and gender distribution

In [22]:
# deleted employees belong to either churned companies or bad record, need to join companies dataset 
#and eliminate bad records

In [32]:
employees_query = "select id, company_id, created_at, hired_at, terminated_on, deleted_at, legal_sex, employment_type from employees where hired_at != '3-01-03 00:00:00' \
and hired_at != '0001-01-20 00:00:00' and hired_at != '0001-08-19 21:54:51' and hired_at != '0021-07-08 05:17:32' and hired_at != '0201-09-01 00:00:00'"
employees = pd.read_sql_query(employees_query, con=engine)

In [33]:
company_bad_re_query = "select id as company_id, deleted_at as c_deleted from companies where deleted_at is not null"
company_bad_re = pd.read_sql_query(company_bad_re_query,con=engine)

In [34]:
employees = employees.merge(company_bad_re, how="left",on="company_id")

In [35]:
employees = employees[employees['c_deleted'].isna()]
employees.loc[employees['terminated_on'].isna()==False,'deleted_at'] = np.nan

In [41]:
#2018 live employees
employees_2018 = employees[employees['created_at']<'2018-12-31 23:59:59']

employees_2018.loc[((employees_2018['terminated_on'].isna())&(employees_2018['deleted_at'].isna())|
                   (employees_2018['terminated_on']>'2018-12-31 23:59:59')
                   |(employees_2018['deleted_at']>'2018-12-31 23:59:59')),"live data"] = True
employees_2018 = employees_2018[employees_2018['live data'] == True]
employees_2018

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,created_at,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-18 16:27:32,2018-04-01,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-15 13:20:33,2018-05-16,NaT,NaT,M,full-time,NaT,True
189,190,8,2018-05-28 19:55:34,2017-03-06,2019-11-22,NaT,F,full-time,NaT,True
197,198,2,2018-05-28 22:44:24,2018-05-28,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 16:00:39,2018-05-29,NaT,NaT,M,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...,...
6334,6354,24,2018-12-31 15:49:56,2018-12-11,2019-02-20,NaT,F,part-time,NaT,True
6335,6355,24,2018-12-31 16:07:26,2018-12-11,2019-02-17,NaT,M,part-time,NaT,True
6336,6356,170,2018-12-31 16:27:37,2019-01-09,2019-12-30,NaT,F,intern,NaT,True
6338,6358,236,2018-12-31 22:04:52,2016-09-01,NaT,NaT,M,full-time,NaT,True
6339,6359,236,2018-12-31 22:04:52,2016-09-01,NaT,NaT,M,full-time,NaT,True

In [42]:
fulltime_employees_2018 = employees_2018[employees_2018['employment_type'] == 'full-time']
fulltime_employees_2018

,id,company_id,created_at,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-18 16:27:32,2018-04-01,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-15 13:20:33,2018-05-16,NaT,NaT,M,full-time,NaT,True
189,190,8,2018-05-28 19:55:34,2017-03-06,2019-11-22,NaT,F,full-time,NaT,True
197,198,2,2018-05-28 22:44:24,2018-05-28,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 16:00:39,2018-05-29,NaT,NaT,M,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...,...
6329,6349,11,2018-12-28 21:18:52,2018-12-12,NaT,NaT,F,full-time,NaT,True
6330,6350,183,2018-12-28 21:27:20,2018-12-28,2019-03-22,NaT,None,full-time,NaT,True
6331,6351,182,2018-12-30 15:55:06,2019-01-02,2019-06-27,NaT,M,full-time,NaT,True
6338,6358,236,2018-12-31 22:04:52,2016-09-01,NaT,NaT,M,full-time,NaT,True
6339,6359,236,2018-12-31 22:04:52,2016-09-01,NaT,NaT,M,full-time,NaT,True

In [43]:
# 2018 employee gender distribution
employees_2018_gender = employees_2018.dropna(subset=['legal_sex'])
employees_2018_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex  size
0         F  1258
1         M  1900
2         P    30

In [45]:
#2019 live employees

employees_2019 = employees[employees['created_at']<'2019-12-31 23:59:59']

employees_2019.loc[((employees_2019['terminated_on'].isna())&(employees_2019['deleted_at'].isna())|
                   (employees_2019['terminated_on']>'2019-12-31 23:59:59')
                   |(employees_2019['deleted_at']>'2029-12-31 23:59:59')),"live data"] = True
employees_2019 = employees_2019[employees_2019['live data'] == True]
employees_2019

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,created_at,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-18 16:27:32,2018-04-01,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-15 13:20:33,2018-05-16,NaT,NaT,M,full-time,NaT,True
197,198,2,2018-05-28 22:44:24,2018-05-28,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 16:00:39,2018-05-29,NaT,NaT,M,full-time,NaT,True
200,201,9,2018-05-30 14:24:19,2014-11-24,2020-07-14 00:00:00,NaT,F,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...,...
25855,26628,580,2019-12-31 17:19:12,2020-01-06,NaT,NaT,M,full-time,NaT,True
25856,26629,580,2019-12-31 17:25:19,2020-01-06,2021-05-06 21:27:18,NaT,M,full-time,NaT,True
25857,26630,1027,2019-12-31 18:15:35,2019-12-31,NaT,NaT,M,intern,NaT,True
25858,26631,611,2019-12-31 19:13:21,2020-01-02,2020-03-24 00:00:00,NaT,M,part-time,NaT,True
25859,26632,120,2019-12-31 19:50:12,2020-08-25,2021-01-12 20:29:35,NaT,F,full-time,NaT,True

In [46]:
# 2019 employee gender distribution
employees_2019_gender = employees_2019.dropna(subset=['legal_sex'])
employees_2019_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex  size
0         F  5573
1         M  7398
2         P   527

In [48]:
#2020 live employees

employees_2020 = employees[employees['created_at']<'2020-12-31 23:59:59']

employees_2020.loc[((employees_2020['terminated_on'].isna())&(employees_2020['deleted_at'].isna())|
                   (employees_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(employees_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
employees_2020 = employees_2020[employees_2020['live data'] == True]
employees_2020

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,created_at,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-18 16:27:32,2018-04-01,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-15 13:20:33,2018-05-16,NaT,NaT,M,full-time,NaT,True
197,198,2,2018-05-28 22:44:24,2018-05-28,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 16:00:39,2018-05-29,NaT,NaT,M,full-time,NaT,True
202,203,11,2018-05-31 19:38:02,2008-01-08,NaT,NaT,F,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...,...
57079,58920,1927,2020-12-31 21:10:40,2005-05-01,NaT,2021-01-01 19:24:55,None,full-time,NaT,True
57080,58921,1827,2020-12-31 21:27:47,2021-01-04,NaT,NaT,F,full-time,NaT,True
57081,58922,1731,2020-12-31 21:58:05,2020-12-14,NaT,NaT,F,full-time,NaT,True
57082,58923,1927,2020-12-31 22:22:32,2021-01-01,NaT,2021-01-02 22:48:12,F,seasonal,NaT,True
57083,58924,1643,2020-12-31 22:45:12,2021-01-06,2021-02-04 23:17:38,NaT,M,other,NaT,True

In [49]:
# 2020 employee gender distribution
employees_2020_gender = employees_2020.dropna(subset=['legal_sex'])
employees_2020_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0         F  13261
1         M  16270
2         P   1145
3         X      7

In [51]:
#2021 live employees

employees_2021 = employees[employees['created_at']<'2021-12-31 23:59:59']

employees_2021.loc[((employees_2021['terminated_on'].isna())&(employees_2021['deleted_at'].isna())|
                   (employees_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(employees_2021['deleted_at']>'2021-12-31 23:59:59')
                   ),"live data"] = True
employees_2021 = employees_2021[employees_2021['live data'] == True]
employees_2021

,id,company_id,created_at,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-18 16:27:32,2018-04-01 00:00:00,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-15 13:20:33,2018-05-16 00:00:00,NaT,NaT,M,full-time,NaT,True
197,198,2,2018-05-28 22:44:24,2018-05-28 00:00:00,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 16:00:39,2018-05-29 00:00:00,NaT,NaT,M,full-time,NaT,True
202,203,11,2018-05-31 19:38:02,2008-01-08 00:00:00,NaT,NaT,F,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...,...
93481,95539,2678,2021-08-16 21:13:38,2020-11-16 00:00:00,NaT,NaT,None,full-time,NaT,True
93482,95540,1898,2021-08-16 21:16:03,2021-08-16 04:00:00,NaT,NaT,None,full-time,NaT,True
93483,95541,1291,2021-08-16 21:21:56,2021-08-30 04:00:00,NaT,NaT,None,full-time,NaT,True
93484,95542,1394,2021-08-16 21:28:58,2021-08-16 06:00:00,NaT,NaT,None,full-time,NaT,True
93485,95543,1394,2021-08-16 21:36:32,2021-09-06 06:00:00,NaT,NaT,None,full-time,NaT,True

In [52]:
# 2021 employee gender distribution
employees_2021_gender = employees_2021.dropna(subset=['legal_sex'])
employees_2021_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0                2
1         F  21980
2         M  24849
3         P   1761
4         X     32

### Industry distribution is classified accourding to industry categorization on Statistics Canada

In [ ]:
all_industry = "select distinct `industry` \
from `companies` \
where `deleted_at` is null"
pd.read_sql_query(all_industry, con=engine)
## Details are in google sheet
## reference: https://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&TVD=1181553